# SATImportOptions Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SATImportOptions Constructor
SATImportOptions Class See Also
---
Constructs a new instance of SATImportOptions with default values of all properties.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public SATImportOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
SATImportOptions()
```

# See Also
SATImportOptions Class
SATImportOptions Overload
Autodesk.Revit.DB Namespace